app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in (utf8 , ratings , commit , action , controller , criteria , )) ORDER BY title
---
  def index
    if !params[:criteria]
      params[:criteria] = session[:criteria]
    else
      params[:ratings] = session[:ratings]
    end
    cond = ""
    if params[:ratings] and params[:ratings].respond_to?(:keys)
      params[:ratings].keys.each do |i|
        cond += '"'+i+'"' + " , "
      end
    end
    cond[-2] = ' ' if cond[-2] == "," if cond.length > 3
# debugger
    @all_ratings = Movie.getCategories
    @classes = {}
    if !params[:criteria]
      @movies = Movie.all(:conditions => (cond.length > 2 ? "rating in (#{cond})" : "1=0"))